# меньше миллиарда

n = int(input("Введите число: "))

dict = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь",
        9: "девять", 10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать",
        15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать",
        20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
        80: "восемьдесят", 90: "девяносто", 100: "сто", 200: "двести", 300: "триста", 400: "четыреста",
        500: "пятьсот", 600: "шестьсот", 700: "семьсот", 800: "восемьсот", 900: "девятьсот"}

# n_str = str(n)

# if n > 999999999:
#     print("Слишком большое число!")
# else:
#     if n < 999999999 and n > 99999999:
#         print(dict[(n//100000000)*100], dict[(((n//1000000 - (n//100000000)*100))//10)*10],
#               dict[n//1000000 - (n//10000000)*10],"миллионов")
#     #                  345        340
    
    
   #(n-n//1000000) 
    
    
    
    
    
    
#     if n in range (21):
#         print(dict[n])
#     else:
#         if n in range (21, 30):
#             print(dict[20], dict[n%20])